const testData = {
	dept: {
			"330000": {
				"1": {
					"kmlNum": 6,
					"line": {
						"num": 17,
						"len": 87670,
						"pics": 0
					},
					"poi": {
						"num": 196,
						"pics": 0
					}
				},
				"9": {
					"kmlNum": 15,
					"line": {
						"num": 39,
						"len": 134331,
						"pics": 36
					},
					"poi": {
						"num": 119,
						"pics": 118
					}
				},
				"id": 330000,
				"pid": 0,
				"name": "浙江省"
			},
			"330100": {
				"id": 330100,
				"pid": 330000,
				"name": "杭州市"
			},
			"330102": {
				"id": 330102,
				"pid": 330100,
				"name": "上城区"
			},
			"330103": {
				"id": 330103,
				"pid": 330100,
				"name": "下城区"
			},
			"330104": {
				"id": 330104,
				"pid": 330100,
				"name": "江干区"
			},
			"330105": {
				"id": 330105,
				"pid": 330100,
				"name": "拱墅区"
			},
			"330106": {
				"id": 330106,
				"pid": 330100,
				"name": "西湖区"
			},
			"330108": {
				"id": 330108,
				"pid": 330100,
				"name": "滨江区"
			},
			"330109": {
				"id": 330109,
				"pid": 330100,
				"name": "萧山区"
			},
			"330110": {
				"id": 330110,
				"pid": 330100,
				"name": "余杭区"
			},
			"330111": {
				"id": 330111,
				"pid": 330100,
				"name": "富阳区"
			},
			"330112": {
				"id": 330112,
				"pid": 330100,
				"name": "临安区"
			},
			"330122": {
				"id": 330122,
				"pid": 330100,
				"name": "桐庐县"
			},
			"330127": {
				"id": 330127,
				"pid": 330100,
				"name": "淳安县"
			},
			"330182": {
				"id": 330182,
				"pid": 330100,
				"name": "建德市"
			},
			"330200": {
				"1": {
					"kmlNum": 3,
					"line": {
						"num": 14,
						"len": 73441,
						"pics": 0
					},
					"poi": {
						"num": 175,
						"pics": 0
					}
				},
				"id": 330200,
				"pid": 330000,
				"name": "宁波市"
			},
			"330203": {
				"id": 330203,
				"pid": 330200,
				"name": "海曙区"
			},
			"330205": {
				"id": 330205,
				"pid": 330200,
				"name": "江北区"
			},
			"330206": {
				"id": 330206,
				"pid": 330200,
				"name": "北仑区"
			},
			"330211": {
				"id": 330211,
				"pid": 330200,
				"name": "镇海区"
			},
			"330212": {
				"id": 330212,
				"pid": 330200,
				"name": "鄞州区"
			},
			"330213": {
				"1": {
					"kmlNum": 2,
					"line": {
						"num": 12,
						"len": 55832,
						"pics": 0
					},
					"poi": {
						"num": 175,
						"pics": 0
					}
				},
				"id": 330213,
				"pid": 330200,
				"name": "奉化区"
			},
			"330225": {
				"id": 330225,
				"pid": 330200,
				"name": "象山县"
			},
			"330226": {
				"1": {
					"kmlNum": 1,
					"line": {
						"num": 2,
						"len": 17609,
						"pics": 0
					},
					"poi": {
						"num": 0,
						"pics": 0
					}
				},
				"id": 330226,
				"pid": 330200,
				"name": "宁海县"
			},
			"330281": {
				"id": 330281,
				"pid": 330200,
				"name": "余姚市"
			},
			"330282": {
				"id": 330282,
				"pid": 330200,
				"name": "慈溪市"
			},
			"330300": {
				"id": 330300,
				"pid": 330000,
				"name": "温州市"
			},
			"330302": {
				"id": 330302,
				"pid": 330300,
				"name": "鹿城区"
			},
			"330303": {
				"id": 330303,
				"pid": 330300,
				"name": "龙湾区"
			},
			"330304": {
				"id": 330304,
				"pid": 330300,
				"name": "瓯海区"
			},
			"330305": {
				"id": 330305,
				"pid": 330300,
				"name": "洞头区"
			},
			"330324": {
				"id": 330324,
				"pid": 330300,
				"name": "永嘉县"
			},
			"330326": {
				"id": 330326,
				"pid": 330300,
				"name": "平阳县"
			},
			"330327": {
				"id": 330327,
				"pid": 330300,
				"name": "苍南县"
			},
			"330328": {
				"id": 330328,
				"pid": 330300,
				"name": "文成县"
			},
			"330329": {
				"id": 330329,
				"pid": 330300,
				"name": "泰顺县"
			},
			"330381": {
				"id": 330381,
				"pid": 330300,
				"name": "瑞安市"
			},
			"330382": {
				"id": 330382,
				"pid": 330300,
				"name": "乐清市"
			},
			"330383": {
				"id": 330383,
				"pid": 330300,
				"name": "龙港市"
			},
			"330400": {
				"id": 330400,
				"pid": 330000,
				"name": "嘉兴市"
			},
			"330402": {
				"id": 330402,
				"pid": 330400,
				"name": "南湖区"
			},
			"330411": {
				"id": 330411,
				"pid": 330400,
				"name": "秀洲区"
			},
			"330421": {
				"id": 330421,
				"pid": 330400,
				"name": "嘉善县"
			},
			"330424": {
				"id": 330424,
				"pid": 330400,
				"name": "海盐县"
			},
			"330481": {
				"id": 330481,
				"pid": 330400,
				"name": "海宁市"
			},
			"330482": {
				"id": 330482,
				"pid": 330400,
				"name": "平湖市"
			},
			"330483": {
				"id": 330483,
				"pid": 330400,
				"name": "桐乡市"
			},
			"330500": {
				"id": 330500,
				"pid": 330000,
				"name": "湖州市"
			},
			"330502": {
				"id": 330502,
				"pid": 330500,
				"name": "吴兴区"
			},
			"330503": {
				"id": 330503,
				"pid": 330500,
				"name": "南浔区"
			},
			"330521": {
				"id": 330521,
				"pid": 330500,
				"name": "德清县"
			},
			"330522": {
				"id": 330522,
				"pid": 330500,
				"name": "长兴县"
			},
			"330523": {
				"id": 330523,
				"pid": 330500,
				"name": "安吉县"
			},
			"330600": {
				"id": 330600,
				"pid": 330000,
				"name": "绍兴市"
			},
			"330602": {
				"id": 330602,
				"pid": 330600,
				"name": "越城区"
			},
			"330603": {
				"id": 330603,
				"pid": 330600,
				"name": "柯桥区"
			},
			"330604": {
				"id": 330604,
				"pid": 330600,
				"name": "上虞区"
			},
			"330624": {
				"id": 330624,
				"pid": 330600,
				"name": "新昌县"
			},
			"330681": {
				"id": 330681,
				"pid": 330600,
				"name": "诸暨市"
			},
			"330683": {
				"id": 330683,
				"pid": 330600,
				"name": "嵊州市"
			},
			"330700": {
				"id": 330700,
				"pid": 330000,
				"name": "金华市"
			},
			"330702": {
				"id": 330702,
				"pid": 330700,
				"name": "婺城区"
			},
			"330703": {
				"id": 330703,
				"pid": 330700,
				"name": "金东区"
			},
			"330723": {
				"id": 330723,
				"pid": 330700,
				"name": "武义县"
			},
			"330726": {
				"id": 330726,
				"pid": 330700,
				"name": "浦江县"
			},
			"330727": {
				"id": 330727,
				"pid": 330700,
				"name": "磐安县"
			},
			"330781": {
				"id": 330781,
				"pid": 330700,
				"name": "兰溪市"
			},
			"330782": {
				"id": 330782,
				"pid": 330700,
				"name": "义乌市"
			},
			"330783": {
				"id": 330783,
				"pid": 330700,
				"name": "东阳市"
			},
			"330784": {
				"id": 330784,
				"pid": 330700,
				"name": "永康市"
			},
			"330800": {
				"id": 330800,
				"pid": 330000,
				"name": "衢州市"
			},
			"330802": {
				"id": 330802,
				"pid": 330800,
				"name": "柯城区"
			},
			"330803": {
				"id": 330803,
				"pid": 330800,
				"name": "衢江区"
			},
			"330822": {
				"id": 330822,
				"pid": 330800,
				"name": "常山县"
			},
			"330824": {
				"id": 330824,
				"pid": 330800,
				"name": "开化县"
			},
			"330825": {
				"id": 330825,
				"pid": 330800,
				"name": "龙游县"
			},
			"330881": {
				"id": 330881,
				"pid": 330800,
				"name": "江山市"
			},
			"330900": {
				"id": 330900,
				"pid": 330000,
				"name": "舟山市"
			},
			"330902": {
				"id": 330902,
				"pid": 330900,
				"name": "定海区"
			},
			"330903": {
				"id": 330903,
				"pid": 330900,
				"name": "普陀区"
			},
			"330921": {
				"id": 330921,
				"pid": 330900,
				"name": "岱山县"
			},
			"330922": {
				"id": 330922,
				"pid": 330900,
				"name": "嵊泗县"
			},
			"331000": {
				"id": 331000,
				"pid": 330000,
				"name": "台州市"
			},
			"331002": {
				"id": 331002,
				"pid": 331000,
				"name": "椒江区"
			},
			"331003": {
				"id": 331003,
				"pid": 331000,
				"name": "黄岩区"
			},
			"331004": {
				"id": 331004,
				"pid": 331000,
				"name": "路桥区"
			},
			"331022": {
				"id": 331022,
				"pid": 331000,
				"name": "三门县"
			},
			"331023": {
				"id": 331023,
				"pid": 331000,
				"name": "天台县"
			},
			"331024": {
				"id": 331024,
				"pid": 331000,
				"name": "仙居县"
			},
			"331081": {
				"id": 331081,
				"pid": 331000,
				"name": "温岭市"
			},
			"331082": {
				"id": 331082,
				"pid": 331000,
				"name": "临海市"
			},
			"331083": {
				"id": 331083,
				"pid": 331000,
				"name": "玉环市"
			},
			"331100": {
				"1": {
					"kmlNum": 1,
					"line": {
						"num": 1,
						"len": 11511,
						"pics": 0
					},
					"poi": {
						"num": 11,
						"pics": 0
					}
				},
				"9": {
					"kmlNum": 1,
					"line": {
						"num": 7,
						"len": 8739,
						"pics": 3
					},
					"poi": {
						"num": 27,
						"pics": 22
					}
				},
				"id": 331100,
				"pid": 330000,
				"name": "丽水市"
			},
			"331102": {
				"id": 331102,
				"pid": 331100,
				"name": "莲都区"
			},
			"331121": {
				"id": 331121,
				"pid": 331100,
				"name": "青田县"
			},
			"331122": {
				"id": 331122,
				"pid": 331100,
				"name": "缙云县"
			},
			"331123": {
				"1": {
					"kmlNum": 1,
					"line": {
						"num": 1,
						"len": 11511,
						"pics": 0
					},
					"poi": {
						"num": 11,
						"pics": 0
					}
				},
				"9": {
					"kmlNum": 1,
					"line": {
						"num": 7,
						"len": 8739,
						"pics": 3
					},
					"poi": {
						"num": 27,
						"pics": 22
					}
				},
				"id": 331123,
				"pid": 331100,
				"name": "遂昌县"
			},
			"331124": {
				"id": 331124,
				"pid": 331100,
				"name": "松阳县"
			},
			"331125": {
				"id": 331125,
				"pid": 331100,
				"name": "云和县"
			},
			"331126": {
				"id": 331126,
				"pid": 331100,
				"name": "庆元县"
			},
			"331127": {
				"id": 331127,
				"pid": 331100,
				"name": "景宁畲族自治县"
			},
			"331181": {
				"id": 331181,
				"pid": 331100,
				"name": "龙泉市"
			}
		},
	charts: [{
		"_id": "605a0fccc2afbd0001f032ba",
		"deptId": "331123",
		"type": 1,
		"createTime": "2021-03-23 23:56:59",
		"status": 2,
		"line": {
			"num": 1,
			"len": 11511,
			"pics": 0
		},
		"poi": {
			"num": 11,
			"pics": 0
		}
	}, {
		"_id": "605c073799548d00018832c3",
		"deptId": "330213",
		"type": 1,
		"createTime": "2021-03-25 11:44:54",
		"status": 2,
		"line": {
			"num": 10,
			"len": 44001,
			"pics": 0
		},
		"poi": {
			"num": 165,
			"pics": 0
		}
	}, {
		"_id": "605d871659633b00016868a2",
		"deptId": "330000",
		"type": 9,
		"createTime": "2021-03-26 15:02:46",
		"status": 4,
		"line": {
			"num": 3,
			"len": 6651,
			"pics": 3
		},
		"poi": {
			"20": 3,
			"27": 3,
			"29": 4,
			"num": 10,
			"pics": 11
		},
		"collector": "韩总"
	}, {
		"_id": "605d88b2f83a000001ce31e1",
		"deptId": "330000",
		"type": 9,
		"createTime": "2021-03-26 15:09:38",
		"status": 2,
		"line": {
			"num": 1,
			"len": 4198,
			"pics": 7
		},
		"poi": {
			"20": 1,
			"21": 1,
			"22": 1,
			"23": 1,
			"num": 4,
			"pics": 6
		},
		"collector": "徐小辉"
	}, {
		"_id": "6066d8cd70634e00011699b7",
		"deptId": "330000",
		"type": 9,
		"createTime": "2021-04-02 16:41:49",
		"status": 2,
		"line": {
			"num": 1,
			"len": 26508,
			"pics": 2
		},
		"poi": {
			"20": 2,
			"27": 1,
			"29": 1,
			"200": 2,
			"num": 6,
			"pics": 5
		},
		"collector": "alex"
	}, {
		"_id": "60682e095f2dbd00016a5ef8",
		"deptId": "330000",
		"type": 9,
		"createTime": "2021-04-03 16:57:45",
		"status": 2,
		"line": {
			"11": {
				"num": 1,
				"len": 4896
			},
			"12": {
				"num": 1,
				"len": 3650
			},
			"13": {
				"num": 2,
				"len": 4817
			},
			"101": {
				"num": 1,
				"len": 2516
			},
			"102": {
				"num": 1,
				"len": 1471
			},
			"103": {
				"num": 1,
				"len": 3144
			},
			"104": {
				"num": 1,
				"len": 1242
			},
			"105": {
				"num": 1,
				"len": 1134
			},
			"106": {
				"num": 1,
				"len": 1719
			},
			"num": 11,
			"len": 54484,
			"pics": 3
		},
		"poi": {
			"26": 1,
			"40": 1,
			"num": 2,
			"pics": 3
		},
		"collector": "超管"
	}, {
		"_id": "606af045afeef600015fbb27",
		"deptId": "331123",
		"type": 9,
		"createTime": "2021-03-14 10:53:12",
		"status": 4,
		"line": {
			"11": {
				"num": 1,
				"len": 1704
			},
			"12": {
				"num": 1,
				"len": 294
			},
			"103": {
				"num": 1,
				"len": 1420
			},
			"104": {
				"num": 1,
				"len": 645
			},
			"106": {
				"num": 2,
				"len": 1996
			},
			"num": 7,
			"len": 8739,
			"pics": 3
		},
		"poi": {
			"20": 9,
			"21": 1,
			"22": 1,
			"23": 1,
			"27": 2,
			"29": 3,
			"200": 10,
			"num": 27,
			"pics": 22
		},
		"collector": "徐小辉"
	}, {
		"_id": "606bf71ef9ac6b000156e4d3",
		"deptId": "330000",
		"type": 1,
		"createTime": "2021-04-06 13:52:29",
		"status": 2,
		"line": {
			"num": 1,
			"len": 665,
			"pics": 0
		},
		"poi": {
			"200": 3,
			"num": 3,
			"pics": 0
		}
	}, {
		"_id": "606c2fa645d6be00018bd1f3",
		"deptId": "330000",
		"type": 1,
		"createTime": "2021-04-06 17:53:42",
		"status": 2,
		"line": {
			"num": 1,
			"len": 2053,
			"pics": 0
		},
		"poi": {
			"200": 7,
			"num": 7,
			"pics": 0
		}
	}, {
		"_id": "606d5b21021bb80001171166",
		"deptId": "330000",
		"type": 9,
		"createTime": "2021-04-07 15:11:29",
		"status": 2,
		"line": {
			"num": 1,
			"len": 844,
			"pics": 0
		},
		"poi": {
			"10": 5,
			"21": 1,
			"num": 7,
			"pics": 8
		},
		"collector": "娄毅平"
	}, {
		"_id": "606d5b23f218d10001ac53ce",
		"deptId": "330000",
		"type": 9,
		"createTime": "2021-04-07 15:11:31",
		"status": 2,
		"line": {
			"num": 1,
			"len": 586,
			"pics": 0
		},
		"poi": {
			"20": 1,
			"num": 1,
			"pics": 2
		},
		"collector": "孙如刚"
	}, {
		"_id": "606d5b2cf218d10001ac53e0",
		"deptId": "330000",
		"type": 9,
		"createTime": "2021-04-07 15:11:39",
		"status": 2,
		"line": {
			"11": {
				"num": 1,
				"len": 100
			},
			"num": 2,
			"len": 1498,
			"pics": 16
		},
		"poi": {
			"20": 1,
			"22": 1,
			"num": 2,
			"pics": 1
		},
		"collector": "陈文聪"
	}, {
		"_id": "606d5b40f218d10001ac542d",
		"deptId": "330000",
		"type": 9,
		"createTime": "2021-04-07 15:12:00",
		"status": 2,
		"line": {
			"num": 1,
			"len": 903,
			"pics": 0
		},
		"poi": {
			"20": 1,
			"22": 2,
			"25": 1,
			"200": 1,
			"num": 7,
			"pics": 9
		},
		"collector": "陈铭"
	}, {
		"_id": "6072721ac1a7260001d7ddad",
		"deptId": "330000",
		"type": 9,
		"createTime": "2021-04-11 11:50:50",
		"status": 2,
		"line": {
			"num": 1,
			"len": 10093,
			"pics": 0
		},
		"poi": {
			"10": 3,
			"200": 1,
			"num": 4,
			"pics": 6
		},
		"collector": "体科所闞"
	}, {
		"_id": "6072ef92c1a7260001d9e584",
		"deptId": "330213",
		"type": 1,
		"createTime": "2021-04-11 20:46:10",
		"status": 2,
		"line": {
			"num": 2,
			"len": 11831,
			"pics": 0
		},
		"poi": {
			"200": 10,
			"num": 10,
			"pics": 0
		}
	}, {
		"_id": "6077a8ff80b8450001fe0b89",
		"deptId": "330000",
		"type": 9,
		"createTime": "2021-04-15 10:46:23",
		"status": 2,
		"line": {
			"11": {
				"num": 2,
				"len": 576
			},
			"12": {
				"num": 1,
				"len": 1165
			},
			"13": {
				"num": 1,
				"len": 323
			},
			"num": 5,
			"len": 5863,
			"pics": 1
		},
		"poi": {
			"20": 1,
			"21": 1,
			"50": 1,
			"num": 3,
			"pics": 3
		},
		"collector": "超管"
	}, {
		"_id": "6078fd853828a70001520782",
		"deptId": "330000",
		"type": 9,
		"createTime": "2021-04-16 10:59:17",
		"status": 2,
		"line": {
			"num": 1,
			"len": 1291,
			"pics": 0
		},
		"poi": {
			"20": 2,
			"21": 1,
			"23": 4,
			"27": 1,
			"40": 4,
			"50": 1,
			"num": 13,
			"pics": 13
		},
		"collector": "体科所"
	}, {
		"_id": "6079098e0ee17800010e6f1e",
		"deptId": "330000",
		"type": 9,
		"createTime": "2021-04-16 11:50:38",
		"status": 2,
		"line": {
			"num": 1,
			"len": 1450,
			"pics": 0
		},
		"poi": {
			"20": 2,
			"23": 4,
			"27": 2,
			"29": 1,
			"40": 4,
			"50": 6,
			"num": 19,
			"pics": 19
		},
		"collector": "体科所"
	}, {
		"_id": "6079119452e6130001718c81",
		"deptId": "330000",
		"type": 9,
		"createTime": "2021-04-16 12:24:52",
		"status": 2,
		"line": {
			"102": {
				"num": 1,
				"len": 171
			},
			"num": 2,
			"len": 1647,
			"pics": 1
		},
		"poi": {
			"20": 5,
			"21": 1,
			"22": 2,
			"23": 1,
			"50": 1,
			"num": 10,
			"pics": 9
		},
		"collector": "体科所"
	}, {
		"_id": "60792d5e2912aa0001887bd2",
		"deptId": "330000",
		"type": 9,
		"createTime": "2021-04-16 14:23:25",
		"status": 2,
		"line": {
			"num": 1,
			"len": 9576,
			"pics": 0
		},
		"poi": {
			"29": 1,
			"50": 1,
			"200": 2,
			"num": 4,
			"pics": 1
		},
		"collector": "超管"
	}, {
		"_id": "607bd530042f930001c29bd2",
		"deptId": "330226",
		"type": 1,
		"createTime": "2021-04-18 14:43:57",
		"status": 2,
		"line": {
			"num": 2,
			"len": 17609,
			"pics": 0
		},
		"poi": {
			"num": 0,
			"pics": 0
		}
	}]
}


function gourpBar(d) {}

function pie(t) {

}


export function groupTree(list) {
	let newList = [];
	let map = {};

	list.forEach((e) => (map[e.id] = e));

	list.forEach((e) => {
		let parent = map[e.parentId];

		if (parent) {
			(parent.children || (parent.children = [])).push(e);
		} else {
			if (!e.parentId) {
				newList.push(e);
			}
		}
	});

	const fn = (list) => {
		list.map((e) => {
			if (e.children instanceof Array) {
				e.children = orderBy(e.children, "orderNum");

				fn(e.children);
			}
		});
	};

	fn(newList);

	return orderBy(newList, "orderNum");
}


module.exports = testData
